ka2_2024/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Catalogs/ЭлементыФинансовыхОтчетов/Forms/НефинансовыйПоказатель/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПриСозданииНаСервере(ЭтотОбъект);
	ИдентификаторГлавногоХранилища = Параметры.ИдентификаторГлавногоХранилища;
	
	Если Параметры.Свойство("ПроизвольныйПоказатель") Тогда
		Заголовок = НСтр("ru = 'Операнд: %1 %2'");
	Иначе
		Заголовок = "%1 %2";
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок,
		Строка(Параметры.ВидЭлемента),
		Строка(НефинансовыйПоказатель));

	Элементы.НастройкаСмещенияПериода.Заголовок = БюджетнаяОтчетностьКлиентСервер.ПредставлениеСмещения(ЭтотОбъект);
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НефинансовыйПоказатель, "ПоОрганизациям, ПоПодразделениям, ПоСценариям");
	Если Не РеквизитыОбъекта.ПоОрганизациям Тогда
		Элементы.ИспользоватьФильтрПоОрганизация.Видимость = Ложь;
	КонецЕсли;
	Если Не РеквизитыОбъекта.ПоПодразделениям Тогда
		Элементы.ИспользоватьФильтрПоПодразделение.Видимость = Ложь;
	КонецЕсли;
	Если Не РеквизитыОбъекта.ПоСценариям Тогда
		Элементы.ИспользоватьФильтрПоСценарий.Видимость = Ложь;
	КонецЕсли;
	
	ПривилегированныйРежимПереключатель = Число(ПривилегированныйРежим);
	
	УправлениеФормой(ЭтотОбъект);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Справочники.ЭлементыФинансовыхОтчетов.ФормаПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НефинансовыеПоказателиБюджетов" Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Прочитать();
		Иначе
			Объект.НаименованиеДляПечати = Параметр;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(АдресЭлементаВХранилище) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСмещенияПериодаНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПериодСмещения", ЭтотОбъект);
	ПараметрыСмещения = БюджетнаяОтчетностьКлиентСервер.ПараметрыОткрытияФормыНастройкиПериода(ЭтотОбъект);
	ПараметрыСмещения.Вставить("НефинансовыйПоказатель", Истина);
	
	ОткрытьФорму("Справочник.ЭлементыФинансовыхОтчетов.Форма.НастройкаПериодаИсточникаДанных",
		ПараметрыСмещения,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьФильтрПриИзменении(Элемент)
	
	УстановитьОтборНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПривилегированныйРежимПереключательПриИзменении(Элемент)
	
	ПривилегированныйРежим = Булево(ПривилегированныйРежимПереключатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеПредставленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	БюджетнаяОтчетностьКлиент.ИзменениеВыраженияПредставленияСортировкиВРедактореФормул(ЭтотОбъект,
		"ВыражениеПредставления", Объект.НаименованиеДляПечати);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ФинансоваяОтчетностьКлиент.ЗавершитьРедактированиеЭлементаОтчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ВыражениеПредставления.Видимость = ЗначениеЗаполнено(Форма.НефинансовыйПоказатель);
	
	Форма.Элементы.НаименованиеДляПечати.Доступность = ПустаяСтрока(Форма.ВыражениеПредставления);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодСмещения(Результат, ДополнительныеПараметры) Экспорт
	
	БюджетнаяОтчетностьКлиент.УстановитьПериодСмещения(Объект, ЭтотОбъект, Результат);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНаСервере()
	
	Справочники.ЭлементыФинансовыхОтчетов.УстановитьНастройкиОтбора(ЭтотОбъект,
		Компоновщик,
		Объект.ВидЭлемента,
		Компоновщик.Настройки);
	
КонецПроцедуры

#КонецОбласти
